In [1]:
# import dependencies
import pandas as pd

# Database
from sqlalchemy import create_engine
from config import username, db_password

In [2]:
#  create the database engine
db_string = f"postgresql://{username}:{db_password}@127.0.0.1:5432/FinalProject"
engine = create_engine(db_string)

In [3]:
# read in data
population2019_df = pd.read_csv("resources/2019_Census_US_Population_Data_By_State_Lat_Long.csv")
population2020_df = pd.read_csv("resources/us_pop_by_state.csv")
population2021_df = pd.read_csv("resources/2021 population USDA.gov.csv")
housing_df = pd.read_csv("resources/realtor-data.csv")

In [4]:
# preview data frames
population2019_df.head()

   state_name  popestimate       lat     long
0     alabama      4903185  32.37772  -86.301
1      alaska       731545  58.30160 -134.420
2     arizona      7278717  33.44814 -112.097
3    arkansas      3017804  34.74661  -92.289
4  california     39512223  38.57667 -121.494

In [5]:
population2020_df.head()

   rank         state state_code  2020_census  percent_of_total
0   1.0    California         CA     39538223            0.1191
1   2.0         Texas         TX     29145505            0.0874
2   3.0       Florida         FL     21538187            0.0647
3   4.0      New York         NY     20201249            0.0586
4   5.0  Pennsylvania         PA     13002700            0.0386

In [6]:
population2021_df.head()

,state_name,pop_1990,pop_2000,pop_2010,pop_2020,pop_2021,change2020_21
0,united states,248790925.0,281424600.0,308745538.0,331449281.0,331893745.0,0.10%
1,alabama,4040389.0,4447207.0,4779736.0,5024279.0,5039877.0,0.30%
2,alaska,550043.0,626933.0,710231.0,733391.0,732673.0,-0.10%
3,arizona,3665339.0,5130247.0,6392017.0,7151502.0,7276316.0,1.70%
4,arkansas,2350624.0,2673293.0,2915918.0,3011524.0,3025891.0,0.50%

In [8]:
housing_df

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000.0,3.0,2.0,0.12,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,for_sale,80000.0,4.0,2.0,0.08,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601.0,1527.0,NaN
2,for_sale,67000.0,2.0,1.0,0.15,"556G 556-G 16 St, Juana Diaz, PR, 00795",556G 556-G 16 St,Juana Diaz,Puerto Rico,795.0,748.0,NaN
3,for_sale,145000.0,4.0,2.0,0.10,"R5 Comunidad El Paraso Calle De Oro R-5 Ponce,...",R5 Comunidad El Paraso Calle De Oro R-5 Ponce,Ponce,Puerto Rico,731.0,1800.0,NaN
4,for_sale,65000.0,6.0,2.0,0.05,"14 Navarro, Mayaguez, PR, 00680",14 Navarro,Mayaguez,Puerto Rico,680.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
923154,for_sale,445000.0,1.0,2.0,0.99,"1008 King St, Chappaqua, NY, 10514",1008 King St,Chappaqua,New York,10514.0,1052.0,2011-05-09
923155,for_sale,418000.0,4.0,2.0,0.40,"3 Elmwood Dr, Monroe, NY, 10950",3 Elmwood Dr,Monroe,New York,10950.0,1650.0,2015-07-21
923156,for_sale,469000.0,4.0,2.0,0.18,"13 N Conger Ave, Congers, NY, 10920",13 N Conger Ave,Congers,New York,10920.0,2123.0,NaN
923157,for_sale,825000.0,5.0,5.0,0.79,"7 Miller Rd, Valley Cottage, NY, 10989",7 Miller Rd,Valley Cottage,New York,10989.0,3775.0,2010-06-02
923158,for_sale,88000.0,NaN,NaN,35.00,"D18 Half Moon Bay Dr, Croton On Hudson, NY, 10520",D18 Half Moon Bay Dr,Croton On Hudson,New York,10520.0,780.0,NaN

## Data Preprocessing

#### 2019 Population Data

In [9]:
# rename state column to match other datasets
population2019_df = population2019_df.rename(columns={
                                        'state_name': 'state',
                                        'popestimate': 'population_2019'})

In [10]:
# drop excess columns
population2019_df = population2019_df.drop(population2019_df.columns[[2,3]], axis=1)

In [11]:
# keep only states: ca, fl, ny, tx, tn
population2019_df = population2019_df.loc[
                                (population2019_df["state"] == "new york")]

# capitalize state names
population2019_df["state"] = population2019_df["state"].str.title()

population2019_df

         state  population_2019
4   California         39512223
9      Florida         21477737
32    New York         19453561
42   Tennessee          6829174
43       Texas         28995881

#### 2020 Population Data

In [12]:
# rename state abbreviation column to match other datasets
population2020_df = population2020_df.rename(columns={
                                        '2020_census': 'population_2020'})

In [13]:
# drop excess columns
population2020_df = population2020_df.drop(population2020_df.columns[[0,2,4]], axis=1)

In [14]:
# keep only states: ca, fl, ny, tx, tn
population2020_df = population2020_df.loc[
                                (population2020_df["state"] == "New York")]

population2020_df

         state  population_2020
0   California         39538223
1        Texas         29145505
2      Florida         21538187
3     New York         20201249
15   Tennessee          6910840

#### 2021 Population Data

In [15]:
# rename state column to match other datasets
population2021_df = population2021_df.rename(columns={
                                        'state_name': 'state',
                                        'pop_2021': 'population_2021'})

In [16]:
# drop excess columns
population2021_df = population2021_df.drop(population2021_df.columns[[1,2,3,4,6]], axis=1)

In [17]:
# keep only states: ca, fl, ny, tx, tn
population2021_df = population2021_df.loc[
                                (population2021_df["state"] == "new york")]

# capitalize state names
population2021_df["state"] = population2021_df["state"].str.title()

population2021_df

         state  population_2021
5   California       39237836.0
10     Florida       21781128.0
33    New York       19835913.0
43   Tennessee        6975218.0
44       Texas       29527941.0

#### Housing Data

In [27]:
housing_df

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000.0,3.0,2.0,0.12,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,for_sale,80000.0,4.0,2.0,0.08,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601.0,1527.0,NaN
2,for_sale,67000.0,2.0,1.0,0.15,"556G 556-G 16 St, Juana Diaz, PR, 00795",556G 556-G 16 St,Juana Diaz,Puerto Rico,795.0,748.0,NaN
3,for_sale,145000.0,4.0,2.0,0.10,"R5 Comunidad El Paraso Calle De Oro R-5 Ponce,...",R5 Comunidad El Paraso Calle De Oro R-5 Ponce,Ponce,Puerto Rico,731.0,1800.0,NaN
4,for_sale,65000.0,6.0,2.0,0.05,"14 Navarro, Mayaguez, PR, 00680",14 Navarro,Mayaguez,Puerto Rico,680.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
923154,for_sale,445000.0,1.0,2.0,0.99,"1008 King St, Chappaqua, NY, 10514",1008 King St,Chappaqua,New York,10514.0,1052.0,2011-05-09
923155,for_sale,418000.0,4.0,2.0,0.40,"3 Elmwood Dr, Monroe, NY, 10950",3 Elmwood Dr,Monroe,New York,10950.0,1650.0,2015-07-21
923156,for_sale,469000.0,4.0,2.0,0.18,"13 N Conger Ave, Congers, NY, 10920",13 N Conger Ave,Congers,New York,10920.0,2123.0,NaN
923157,for_sale,825000.0,5.0,5.0,0.79,"7 Miller Rd, Valley Cottage, NY, 10989",7 Miller Rd,Valley Cottage,New York,10989.0,3775.0,2010-06-02
923158,for_sale,88000.0,NaN,NaN,35.00,"D18 Half Moon Bay Dr, Croton On Hudson, NY, 10520",D18 Half Moon Bay Dr,Croton On Hudson,New York,10520.0,780.0,NaN

In [28]:
# drop unnecessary columns
housing_df = housing_df.drop(housing_df.columns[[5,6,]], axis=1)

In [29]:
# keep only states: ny, tn
housing_df = housing_df.loc[
                        (housing_df["state"] == "New York") |
                        (housing_df["state"] == "Tennessee")]
housing_df

,status,price,bed,bath,acre_lot,city,state,zip_code,house_size,sold_date
30149,for_sale,175000.0,3.0,1.0,60.00,Berlin,New York,12022.0,1176.0,NaN
54248,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
54258,for_sale,225000.0,4.0,2.0,0.24,Copake,New York,12521.0,1239.0,2018-02-01
54259,for_sale,419000.0,3.0,3.0,1.90,Copake,New York,12516.0,1800.0,NaN
54262,for_sale,365000.0,3.0,2.0,2.00,Copake,New York,12517.0,1482.0,NaN
...,...,...,...,...,...,...,...,...,...,...
923154,for_sale,445000.0,1.0,2.0,0.99,Chappaqua,New York,10514.0,1052.0,2011-05-09
923155,for_sale,418000.0,4.0,2.0,0.40,Monroe,New York,10950.0,1650.0,2015-07-21
923156,for_sale,469000.0,4.0,2.0,0.18,Congers,New York,10920.0,2123.0,NaN
923157,for_sale,825000.0,5.0,5.0,0.79,Valley Cottage,New York,10989.0,3775.0,2010-06-02
923158,for_sale,88000.0,NaN,NaN,35.00,Croton On Hudson,New York,10520.0,780.0,NaN

In [30]:
# keep only dates jan 2019 - dec 2021
housing_df = housing_df[
                    (housing_df["sold_date"] >= "2019-01-01") & 
                    (housing_df["sold_date"] <= "2021-12-31")]
housing_df

,status,price,bed,bath,acre_lot,city,state,zip_code,house_size,sold_date
54248,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
54533,for_sale,435000.0,3.0,2.0,5.01,East Chatham,New York,12060.0,2504.0,2020-11-09
54551,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
54952,for_sale,625000.0,NaN,NaN,19.70,Hillsdale,New York,12529.0,NaN,2021-01-20
55599,for_sale,625000.0,NaN,NaN,19.70,Hillsdale,New York,12529.0,NaN,2021-01-20
...,...,...,...,...,...,...,...,...,...,...
923109,for_sale,799000.0,5.0,4.0,2.32,Tomkins Cove,New York,10986.0,3280.0,2021-04-15
923110,for_sale,1200000.0,4.0,3.0,5.20,Stony Point,New York,10980.0,2800.0,2021-01-08
923142,for_sale,799000.0,5.0,3.0,0.11,West Harrison,New York,10604.0,2420.0,2019-08-12
923148,for_sale,519000.0,4.0,3.0,0.54,Cornwall,New York,12518.0,2612.0,2020-01-13
923149,for_sale,355000.0,3.0,3.0,0.16,New Windsor,New York,12553.0,1680.0,2019-06-28

In [31]:
# drop rows with null values
housing_df = housing_df.dropna()
housing_df

,status,price,bed,bath,acre_lot,city,state,zip_code,house_size,sold_date
54248,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
54533,for_sale,435000.0,3.0,2.0,5.01,East Chatham,New York,12060.0,2504.0,2020-11-09
54551,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
56030,for_sale,339000.0,4.0,5.0,0.51,New Lebanon,New York,12125.0,3133.0,2019-09-11
56088,for_sale,625000.0,4.0,2.0,5.20,Copake Falls,New York,12517.0,2029.0,2019-10-23
...,...,...,...,...,...,...,...,...,...,...
923109,for_sale,799000.0,5.0,4.0,2.32,Tomkins Cove,New York,10986.0,3280.0,2021-04-15
923110,for_sale,1200000.0,4.0,3.0,5.20,Stony Point,New York,10980.0,2800.0,2021-01-08
923142,for_sale,799000.0,5.0,3.0,0.11,West Harrison,New York,10604.0,2420.0,2019-08-12
923148,for_sale,519000.0,4.0,3.0,0.54,Cornwall,New York,12518.0,2612.0,2020-01-13
923149,for_sale,355000.0,3.0,3.0,0.16,New Windsor,New York,12553.0,1680.0,2019-06-28

In [32]:
housing_df.dtypes

status         object
price         float64
bed           float64
bath          float64
acre_lot      float64
city           object
state          object
zip_code      float64
house_size    float64
sold_date      object
dtype: object

## Export Data to PostgreSQL Database

In [34]:
# export dataframes to perform sql join to add populations to zillow & housing dataframes
population2019_df.to_sql(name="population_2019", con=engine)
population2020_df.to_sql(name="population_2020", con=engine)
population2021_df.to_sql(name="population_2021", con=engine)
housing_df.to_sql(name="housing", con=engine)